run/benchmark/surfaceTension/curvatureSphere/curvature3D/system/perfectVOFDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

field alpha1; 
centre (1.01 0 1.01);
surfType cylinder;
direction (0 1 0);

type searchableCylinder;
radius 0.49999999;
point1 (1.01 -100 1.01);
point2 (1.01 100 1.01);

// ************************************************************************* //
